VISA DEBT REPAYMENT Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>{{MerchantID}}</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{TransactionSecurityKey}}</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-{{Version}}">
       <merchantID>{{MerchantID}}</merchantID>
      <merchantReferenceCode>{{$timestamp}}</merchantReferenceCode>
        <debtIndicator>true</debtIndicator>
        <billTo>
            <firstName>John</firstName>
            <lastName>Doe</lastName>
            <street1>1295 Charleston Road</street1>
            <city>Mountain View</city>
            <state>CA</state>
            <postalCode>28650</postalCode>
            <country>US</country>
            <phoneNumber>9999999999</phoneNumber>
            <email>null@cybersource.com</email>
        </billTo>
        <purchaseTotals>
            <currency>USD</currency>
            <grandTotalAmount>22.00</grandTotalAmount>
        </purchaseTotals>
        <card>
            <accountNumber>411111xxxxx11111</accountNumber>
            <expirationMonth>11</expirationMonth>
            <expirationYear>2020</expirationYear>
        </card>
        <ccAuthService run="true">
            <billPayment>true</billPayment>
        </ccAuthService>
        <ccCaptureService run="true"/>
    </requestMessage>
</soapenv:Body>

</soapenv:Envelope>
